Tekla Open API Reference for Tekla Structures 2025
GridLine.GridLabel.GridPoint Property
 The grid line point, without offsets taken into consideration (model grid line coordinates).
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public Point GridPoint { get; }
Public ReadOnly Property GridPoint As Point
	Get
Property Value
Type: Point
See Also
Reference
GridLine.GridLabel Class
Tekla.Structures.Drawing Namespace